reports/stage4/wrkLogsPut1.txt
Running 50s test @ http://localhost:8080
  1 threads and 20 connections
  Thread calibration: mean lat.: 1.451ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.73ms    1.94ms  52.32ms   87.19%
    Req/Sec     1.05k   160.70     5.67k    82.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.73ms
 90.000%    4.41ms
 99.000%    6.62ms
 99.900%   25.45ms
 99.990%   46.72ms
 99.999%   52.35ms
100.000%   52.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.139     0.000000            1         1.00
       0.594     0.100000         3990         1.11
       0.770     0.200000         8003         1.25
       0.912     0.300000        11994         1.43
       1.059     0.400000        15988         1.67
       1.213     0.500000        19960         2.00
       1.298     0.550000        21958         2.22
       1.387     0.600000        23951         2.50
       1.483     0.650000        25943         2.86
       1.595     0.700000        27931         3.33
       1.728     0.750000        29929         4.00
       1.813     0.775000        30920         4.44
       1.921     0.800000        31925         5.00
       2.059     0.825000        32921         5.71
       2.285     0.850000        33912         6.67
       3.801     0.875000        34909         8.00
       4.135     0.887500        35408         8.89
       4.407     0.900000        35912        10.00
       4.627     0.912500        36414        11.43
       4.815     0.925000        36913        13.33
       5.023     0.937500        37412        16.00
       5.115     0.943750        37653        17.78
       5.235     0.950000        37910        20.00
       5.347     0.956250        38152        22.86
       5.467     0.962500        38403        26.67
       5.599     0.968750        38658        32.00
       5.671     0.971875        38778        35.56
       5.747     0.975000        38899        40.00
       5.851     0.978125        39025        45.71
       5.967     0.981250        39151        53.33
       6.127     0.984375        39273        64.00
       6.231     0.985938        39335        71.11
       6.359     0.987500        39401        80.00
       6.491     0.989062        39461        91.43
       6.731     0.990625        39522       106.67
       7.155     0.992188        39585       128.00
       7.603     0.992969        39616       142.22
       8.055     0.993750        39647       160.00
       8.631     0.994531        39678       182.86
       9.175     0.995313        39709       213.33
       9.743     0.996094        39741       256.00
       9.975     0.996484        39756       284.44
      10.351     0.996875        39772       320.00
      12.239     0.997266        39787       365.71
      13.335     0.997656        39803       426.67
      16.991     0.998047        39819       512.00
      17.823     0.998242        39827       568.89
      20.575     0.998437        39834       640.00
      22.191     0.998633        39842       731.43
      22.943     0.998828        39850       853.33
      26.159     0.999023        39858      1024.00
      27.199     0.999121        39862      1137.78
      27.455     0.999219        39865      1280.00
      30.847     0.999316        39869      1462.86
      31.951     0.999414        39873      1706.67
      32.895     0.999512        39877      2048.00
      36.031     0.999561        39879      2275.56
      37.151     0.999609        39881      2560.00
      37.279     0.999658        39883      2925.71
      37.631     0.999707        39885      3413.33
      42.175     0.999756        39887      4096.00
      42.367     0.999780        39888      4551.11
      42.399     0.999805        39889      5120.00
      42.527     0.999829        39890      5851.43
      46.591     0.999854        39891      6826.67
      46.719     0.999878        39892      8192.00
      46.719     0.999890        39892      9102.22
      46.751     0.999902        39893     10240.00
      46.751     0.999915        39893     11702.86
      51.615     0.999927        39894     13653.33
      51.615     0.999939        39894     16384.00
      51.615     0.999945        39894     18204.44
      52.287     0.999951        39895     20480.00
      52.287     0.999957        39895     23405.71
      52.287     0.999963        39895     27306.67
      52.287     0.999969        39895     32768.00
      52.287     0.999973        39895     36408.89
      52.351     0.999976        39896     40960.00
      52.351     1.000000        39896          inf
#[Mean    =        1.735, StdDeviation   =        1.935]
#[Max     =       52.320, Total count    =        39896]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  478.00us
 75.000%  696.00us
 90.000%    3.73ms
 99.000%    5.35ms
 99.900%   22.00ms
 99.990%   46.37ms
 99.999%   51.26ms
100.000%   51.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            2         1.00
       0.204     0.100000         3994         1.11
       0.274     0.200000         7992         1.25
       0.349     0.300000        12029         1.43
       0.411     0.400000        15980         1.67
       0.478     0.500000        19982         2.00
       0.519     0.550000        21957         2.22
       0.566     0.600000        23938         2.50
       0.609     0.650000        25951         2.86
       0.652     0.700000        27966         3.33
       0.696     0.750000        29962         4.00
       0.720     0.775000        30930         4.44
       0.748     0.800000        31932         5.00
       0.787     0.825000        32937         5.71
       0.846     0.850000        33916         6.67
       3.365     0.875000        34911         8.00
       3.613     0.887500        35412         8.89
       3.729     0.900000        35919        10.00
       3.853     0.912500        36415        11.43
       4.011     0.925000        36908        13.33
       4.215     0.937500        37410        16.00
       4.327     0.943750        37653        17.78
       4.415     0.950000        37907        20.00
       4.503     0.956250        38151        22.86
       4.595     0.962500        38414        26.67
       4.687     0.968750        38656        32.00
       4.739     0.971875        38781        35.56
       4.795     0.975000        38902        40.00
       4.867     0.978125        39025        45.71
       4.943     0.981250        39150        53.33
       5.051     0.984375        39273        64.00
       5.123     0.985938        39336        71.11
       5.191     0.987500        39398        80.00
       5.287     0.989062        39460        91.43
       5.391     0.990625        39522       106.67
       5.647     0.992188        39585       128.00
       5.875     0.992969        39617       142.22
       6.315     0.993750        39647       160.00
       6.967     0.994531        39678       182.86
       7.615     0.995313        39709       213.33
       8.143     0.996094        39742       256.00
       8.327     0.996484        39756       284.44
       8.775     0.996875        39772       320.00
       9.023     0.997266        39788       365.71
       9.319     0.997656        39803       426.67
      11.295     0.998047        39819       512.00
      12.383     0.998242        39826       568.89
      14.159     0.998437        39834       640.00
      16.863     0.998633        39842       731.43
      20.463     0.998828        39850       853.33
      22.223     0.999023        39858      1024.00
      24.431     0.999121        39861      1137.78
      25.935     0.999219        39865      1280.00
      27.055     0.999316        39869      1462.86
      30.335     0.999414        39873      1706.67
      32.319     0.999512        39877      2048.00
      35.455     0.999561        39879      2275.56
      36.383     0.999609        39882      2560.00
      36.479     0.999658        39883      2925.71
      37.119     0.999707        39885      3413.33
      40.767     0.999756        39887      4096.00
      41.695     0.999780        39888      4551.11
      41.887     0.999805        39889      5120.00
      41.983     0.999829        39890      5851.43
      46.335     0.999854        39891      6826.67
      46.367     0.999878        39892      8192.00
      46.367     0.999890        39892      9102.22
      46.495     0.999902        39893     10240.00
      46.495     0.999915        39893     11702.86
      50.911     0.999927        39894     13653.33
      50.911     0.999939        39894     16384.00
      50.911     0.999945        39894     18204.44
      51.039     0.999951        39895     20480.00
      51.039     0.999957        39895     23405.71
      51.039     0.999963        39895     27306.67
      51.039     0.999969        39895     32768.00
      51.039     0.999973        39895     36408.89
      51.263     0.999976        39896     40960.00
      51.263     1.000000        39896          inf
#[Mean    =        0.998, StdDeviation   =        1.786]
#[Max     =       51.232, Total count    =        39896]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49957 requests in 50.00s, 3.95MB read
Requests/sec:    999.13
Transfer/sec:     80.98KB